<?php
  $pagename = 'Myanmar3 (SIL) လက်ကွက် အသုံးပြုပုံ';
  $pagetitle = 'Myanmar3 (SIL) လက်ကွက် အသုံးပြုပုံ';
  require_once('header.php');
?>



		<p>
				မြန်မာလက်ကွက် ဇယားသည် ဝင်းလက်ကွက် နှင့် အများအားဖြင့် ဆင်တူပါသည်။ မြန်မာယူနီကုဒ်သည် အက္ခရာတစ်ခုမှ ပုံသဏ္ဌာန် ကွဲပြားသော စာလုံးပုံ အမျိုးမျိုးကို ခလုတ်တခုတည်း (ကုဒ်တစ်ခုတည်း ) ဖြင့်တည်ဆောက်ထားပါသည်။
				ဆိုလိုသည်မှာ ရရစ် ( အကြီး အသေး အပြတ် ) အမျိုးမျိုး မရှိပါ။ ကီးဘုတ်ပေါ်တွင် ရရစ်တခုသာ တွေ့ရပါမည်။	ထို့အတူ တစ်ချောင်းငင် နှစ်ချောင်းငင် အရှည်ကိုလည်း တွေ့ရမည်မဟုတ်ပါ။ စာလုံးပေါင်း သတ်ပုံအတိုင်း ရိုက်နှိပ်သွားပါက လိုချင်သော စာလုံးပုံစံကို အလိုလျောက် ပြောင်းလဲ ပေးပါလိမ့်မည်။
				မြန်မာစာ လက်ရေးရေးသည့် အစီအစဉ်အတိုင်း ရိုက်သွားရုံသာ ဖြစ်ပါသည်။ မြန်မာစာကို ရေးတတ်သူတိုင်း ကွန်ပျူတာတွင် ရိုက်နိုင်ရန် ပြုလုပ်ထားသည့် ယခု ၂၁ ရာစုခေတ် နည်းပညာ ဖြစ်ပါသည်။
		</p>


		<h3 id="1">
			၁။Myanmar3 လက်ကွက် ဇယား
		</h3 >
		<h4>Shift မနှိပ်ထားပုံ</h4>

	     <p><img src="sil_myanmar_my3U_.png"></p>
		<h4>Shift နှိပ်ထားပုံ</h4>
      <p><img src="sil_myanmar_my3U_S.png"></p>

		</div>
				<p align="right"><a href="#top">^^အပေါ်သို့</a></p>
		<h3 id="2">
			၂။ ပါဠ်ဆင့် ( စာလုံးဆင့် )များ ရိုက်သွင်းနည်း
		</h3>
		<p>
			စာလုံးဆင့်များရိုက်နှိပ်လိုပါက အဆင့်ခလုတ်  [ F ] shift + f ကိုရိုက်နှိပ်ပြီး ဆင့်လိုသော အက္ခရာကို ဆက်ရိုက်လိုက်ပါက စာလုံးဆင့် ဖြစ်သွားပါလိမ့်မည်။
		</p>
				<table border="1" cellspacing="0" cellpadding="7">
					<tr>
						<th>စာလုံးပုံ</th>
						<th>စာလုံးပေါင်းပုံ</th>
						<th>အင်္ဂလိပ်ကီးခလုတ်</th>
					</tr>
					<tr>
						<td>ဋ္ဌ</td>
						<td>ဋ +  ္‌ + ဌ</td>
						<td># +  F‌ + X </td>
					</tr>
					<tr>
						<td>ဏ္ဌ</td>
						<td>ဏ +  ္‌ + ဌ </td>
						<td>P +  F‌ + X </td>
					</tr>
					<tr>
						<td>ဍ္ဎ</td>
						<td>ဍ +  ္‌ + ဎ</td>
						<td>! +  F‌ + ~ </td>
					</tr>
					<tr>
						<td>ဏ္ဍ</td>
						<td>ဏ +  ္‌ + ဍ</td>
						<td>P +  F‌ + ! </td>
					</tr>
				</table>
				<br />
				<p align="right"><a href="#top">^^အပေါ်သို့</a></p>
			<h3 id="3">
				၃။ မတူကွဲပြားသော အက္ခရာများ
			</h3>
		<ol>
			<li>သုည '၀' နှင့် ဝလုံး 'ဝ' မတူပါ</li>
			<li>စလုံးရပင့် 'စျ' နှင့် ဇမြင်ဆွဲ 'ဈ'မတူပါ</li>
			<li>ညလေး 'ဉ  ' နှင့် အက္ခရာအု 'ဥ'မတူပါ</li>
			<li>သရရစ် 'သြ' နှင့် အက္ခရာအော 'ဩ'မတူပါ</li>
		</ol>
		<p>စ + ဉ  + ် = စဉ် </p>
		<br />
		<p align="right"><a href="#top">^^အပေါ်သို့</a></p>
			<h3 id="4">
				၄။ နမူနာပြ စာရိုက်နည်း
			</h3>
		<p>
			စာလုံးအချို့ကို နမူနာအဖြစ် အောက်ပါဇယားတွင် ရိုက်နှိပ်ပုံအဆင့်ဆင့်ကို ဖေါ်ပြအပ်ပါသည်။ ရရစ် အက္ခရာကို ဗျည်းနောက်မှ ရိုက်ရပါမည်။ ိ ု ၊ ု ံ ၊ ံ ့ ကဲ့သိုသော
			အပေါ်အောက် စာလုံးများကို နှစ်သက်ရာ အရင်ရိုက်နိုင်ပါသည်။ ၎င်းအစီအစဉ်များကို တမျိုးတည်း ဖြစ်စေရန် အလိုလျောက် ပြင်ဆင်ပေးပါလိမ့်မည်။
		</p>
				<table border="1" cellspacing="0" cellpadding="7">
				<tr>
				<th>စာလုံးပုံ</th>
				<th>စာလုံးပေါင်းပုံ</th>
				<th>အင်္ဂလိပ်ကီးခလုတ်</th>
				</tr>
				<tr>
				<td>ကျူ</td>
				<td>က + ျ + ူ</td>
				<td>u + s + l</td>
				</tr>
				<tr>
				<td>ကျို</td>
				<td>က + ျ + ိ +ု</td>
				<td>u + s + d + k</td>
				</tr>
				<tr>
				<td>ကျောင်း</td>
				<td>ေ+က+ျ+ာ+င+ ်+ း</td>
				<td>a + u + s + m + i + f + ;</td>
				</tr>
				<tr>
				<td>ကျွမ်း</td>
				<td>က+ ျ +  ွ + မ + ် + း</td>
				<td>u + s + G + r + f + ;</td>
				</tr>
				<tr>
				<td>ကြီး</td>
				<td>က+ ြ  +  ီ + း</td>
				<td>u + j + D + ;</td>
				</tr>
				<tr>
				<td>ခြုံ</td>
				<td>ခ+ြ + ု+ ံ</td>
				<td>c + j + k + H</td>
				</tr>
				<tr>
				<td>မြို့</td>
				<td>မ + ြ  +  ိ + ု + ့</td>
				<td>r + j + d + k + h</td>
				</tr>
				<tr>
				<td>ကြွေး</td>
				<td>ေ + က + ြ + ွ + း</td>
				<td>a + u + j + G + ;</td>
				</tr>
				<tr>
				<td>မြှင့်</td>
				<td>မ + ြ + ှ + င +  ် + ့</td>
				<td>r + j + S + i + f +h</td>
				</tr>
				<tr>
				<td>ငြှိုး</td>
				<td>င + ြ + ှ + ိ + ု + း</td>
				<td>i + j + S + d + k + ;</td>
				</tr>
				<tr>
				<td>စက္ကူ</td>
				<td>စ + က + ္ + က + ူ</td>
				<td>p + u + F + u + l</td>
				</tr>
				<tr>
				<td>လိမ္မော်</td>
				<td>လ + ိ + မ + ္ + ‌ေ + မ + ာ + ် (သို့)<br /> လ+ ိ +‌ ေ + မ + ္ + မ + ာ + ် </td>
				<td>v + d + r + F + a + r + m + f (or) <br /> v + d + a + r + F + r + m + f</td>
				</tr>
				<tr>
				<td>အင်္ဂါ</td>
				<td>အ + င + ် + ္ + ဂ + ါ</td>
				<td>t + i + f + F + : + g</td>
				</tr>
				<tr>
				<td>အင်္ကျီ</td>
				<td>အ + င + ် + ္ + က + ျ +  ီ</td>
				<td>t + i + f + F + u + s + D</td>
				</tr>
				<tr>
				<td>သင်္ဘော</td>
				<td>သ + င + ်  + ္ + ‌ေ + ဘ + ာ</td>
				<td>o + i + f + F + a + b + m</td>
				</tr>
				<tr>
				<td>ဥက္ကဋ္ဌ</td>
				<td>ဥ + က + ္ + က + ဋ + ္ + ဌ</td>
				<td>U + u + F + u + # + F + X</td>
				</tr>
				<tr>
				<td>ဂုဏဝုဍ္ဎိ</td>
				<td>ဂ + ု+ ဏ+ ဝ + ု+ ဍ + ္ + ဎ + ိ</td>
				<td>: + k + P + W + k + ! + F + ~ + d</td>
				</tr>
				<tr>
				<td>သဏ္ဌာန်</td>
				<td>သ + ဏ + ္ + ဌ + ာ + န + ်</td>
				<td>o + P + F + X + m + e + f</td>
				</tr>
				<tr>
				<td>ဘဏ္ဍာ</td>
				<td>ဘ + ဏ + ္ + ဍ + ာ</td>
				<td>b + P + F + ! + m</td>
				</tr>
				<tr>
				<td>ဣန္ဒြေ</td>
				<td>ဣ + န + ္ + ​ေ + ဒ + ြ (သို့) <br /> ဣ + ​ေ + န + ္ + ဒ + ြ</td>
				<td>E + e + F + a + K + j (or) <br /> E + a + e + F + K + j</td>
				</tr>
				<tr>
				<td>ခြင်္သေ့</td>
				<td>ခ + ြ + င + ် + ္ + ​ေ + သ + ့</td>
				<td>c + j + i + f + F + a + o + h</td>
				</tr>
				<tr>
				<td>သိင်္ဂီ</td>
				<td>သ + ိ + င + ် + ္ + ဂ + ီ</td>
				<td>o + d + i + f + F + : + D</td>
				</tr>
				<tr>
				<td>သင်္ဂြိုဟ်</td>
				<td>သ + င + ် + ္ + ဂ + ြ + ိ + ု + ဟ + ်</td>
				<td>o + i + f + F + : + j + d + k + [ + f</td>
				</tr>
				<tr>
				<td>သင်္ချိုင်း</td>
				<td>သ + င + ် + ္ + ခ + ျ + ိ + ု + င + ် + း</td>
				<td>o + i + f + F + c + s + d + k + i + f + ;</td>
				</tr>
				<tr>
				<td>ဓါတု (သို့) ဓာတု</td>
				<td>ဓ + ါ + တ + ု (သို့) ဓ + ာ + တ + ု</td>
				<td>L + g + w + k (or) L + m + w + k</td>
				</tr>
				<tr>
				<td>ပုဏ္ဏေးမ</td>
				<td>ပ + ု + ဏ + ္ + ​ေ + ဏ + း + မ (သို့) <br /> ပ + ု + ​ေ + ဏ + ္ + ဏ + း + မ</td>
				<td>y + k + P+ F + a + P + ; + r (or) <br /> y + k + a + P + F + P + ; + r</td>
				</tr>
				</table>
				<br />
				<p align="right"><a href="#top">^^အပေါ်သို့</a></p>

    <p>ဤအချက်အလက်များအား suntun မူလ စာပြုစုပြီး andjc မှ ဖြည့်စွက်ထားသည်။<br/>
    <a rel="license" href="http://creativecommons.org/licenses/by/3.0/"><img alt="Creative Commons License" style="border-width:0;width: 80px;" src="80x15.png" /></a><br />ဤအချက်အလက် ပြုစုမှုကို <a rel="license" href="http://creativecommons.org/licenses/by/3.0/">Creative Commons Attribution 3.0 International License</a> ဖြင့် စရင်းသွင်းပါသည်။
    </p>
