<?php
  $pagename = 'MyanCode-San';
  $pagetitle = 'MyanCode-San';
  require_once('header.php');
?>


<h1>Start Using MyanCode-San</h1>

<p>
    သက္ကတစာလုံးအပြည့်အစုံပါဝင်သော မြန်မာကီးဘုတ်
</p>

<h1>Keyboard Layout</h1>

<!-- Insert Keyboard Layout Images or HTML here -->

<h3>Shift မနှိပ်ထားသော</h3>
<p><img src="myancode_san_normal.png" alt=""></p>

<h3>Shift နှိပ်ထားသော</h3>
<p><img src="myancode_san_shift.png" alt=""></p>

<h3>Right Alt ( ctrl + alt ) နှိပ်ထားသော</h3>
<p><img src="myancode_san_altgr.png" alt=""></p>

<h3>Shift + Right Alt ( shift + ctrl + alt ) နှိပ်ထားသော</h3>
<p><img src="myancode_san_shift_altgr.png" alt=""></p>

<p>ခဲတံ ဘောပင်တိုဖြင့် စာရေးခဲ့သကဲ့သို့ စာရိုက်နိုင်သော လက်ကွက်ဖြစ်ပါသည်။ </p>
<h2 id="-">လက်ကွက်နေရာ ချထားပုံ</h2>
<p>shift မနှိပ်ဘဲ ဒီတိုင်း ရိုးရိုးရိုက်ရသော key များအားလုံး ဝင်းအင်းဝနှင့် အကုန်တူပါသည်။ shift နှင့်တွဲရိုက်⁠ရသော key များတွင် မလိုရာတချို့ဖြုတ်၍ လိုရာတချို့ ဖြ​ည့်စွက်ထားပါသည်။</p>
<br>
<h2 id="-">သဝေထိုး</h2>
<p>သဝေထိုးအရင်ရိုက်သော စနစ်ဖြစ်ပါသည်။ </p>
<table>
<thead>
<tr>
<th>စာသား</th>
<th>မြန်မာအက္ခရာများ</th>
<th>keys</th>
</tr>
</thead>
<tbody>
<tr>
<td>မေမေ</td>
<td>⁠ေ + မ + ⁠ေ + မ</td>
<td>a + r + a + r</td>
</tr>
<tr>
<td>သောကြာ</td>
<td>⁠ေ + သ + ာ + က +  ြ  +  ာ</td>
<td>a + o + m + u + j + m</td>
</tr>
</tbody>
</table>
<h2 id="-">ဗျည်းတွဲ ဗျည်းယှဥ်သရများ</h2>
<p>ယပင့် ရရစ် ဝဆွဲ ဟထိုး လုံးကြီးတင်၊ တချောင်းငင်၊ သေးသေးတင်၊ အောက်မြစ် စသည်တို့ကို သင်ပုန်ကြီး အစဉ်ကျအောင်  ရိုက်ရပါမည်။ ⁠</p>
<p>ဗျည်းပြီးမှ ရရစ်စသည်ကို ရိုက်ရမည်။ အစဉ်မှားက အလိုအ⁠လျောက် ပြင်ဆင်ပေးမည် မဟုတ်ဘဲ အစဉ်မှားသော အက္ခရာများကို ဖျက်ပစ်ပါသည်။ မိမိရိုက်⁠လိုက်သော အက္ခရာတွဲများ မပေါ် ပျက်သွားပါက အစဉ်မှားနေပြီဟု သိပါ။ </p>
<table>
<thead>
<tr>
<th>စာသား</th>
<th>အက္ခရာများ</th>
<th>keys</th>
</tr>
</thead>
<tbody>
<tr>
<td>မျှစ်</td>
<td>မ + ျ + ှ + စ + ်</td>
<td>r + s + S + p + f</td>
</tr>
<tr>
<td>မွှေး</td>
<td>⁠ေ + မ + ွ + ှ</td>
<td>a + r + G + S + ;</td>
</tr>
<tr>
<td>ကျွေး</td>
<td>⁠ေ + က + ျ + ွ + း</td>
<td>a + u + s + G + ;</td>
</tr>
<tr>
<td>မှို</td>
<td>မ + ှ + ိ + ု</td>
<td>r + S + d + k</td>
</tr>
<tr>
<td>ကျို</td>
<td>က + ျ + ိ + ု</td>
<td>u + s + d+ k</td>
</tr>
<tr>
<td>မြို့</td>
<td>မ + ြ + ိ + ု + ့</td>
<td>r + j + d + k + h</td>
</tr>
<tr>
<td>မြှင့်</td>
<td>မ + ြ + ှ + င +် + ့</td>
<td>r + j + S + i + f + h</td>
</tr>
<tr>
<td>မြှုံး</td>
<td>မ + ြ + ှ + ု + ံ + း</td>
<td>r + j + S + k + H + ;</td>
</tr>
<tr>
<td>ကံ့</td>
<td>က + ံ + ့</td>
<td>u + H + h</td>
</tr>
<tr>
<td>ဘွဲံ</td>
<td>ဘ + ွ + ဲ + ့</td>
<td>b + G + J + h</td>
</tr>
<tr>
<td>ခေါ်</td>
<td>⁠ေ + ခ + ါ + ်</td>
<td>a + c + g + f</td>
</tr>
</tbody>
</table>
<h2 id="-">ပါဌ်ဆင့် ( နှစ်လုံးဆင့် )</h2>
<p>က္က နှစ်လုံးဆင့်ကို ရိုက်လိုပါက အပေါ်က (က) ကို ပုံမှန်ရိုက်နေကျအတိုင်း ရိုက်ပါ။ အောက်၌ ရှိသော(က) ကို ရိုက်လိုပါက  shift + f ကို အရင်ရိုက်ပြီး နောက်မှ အောက်၌ ထားလိုသော (က) ဗျည်းကို ရိုက်ပါ။ ( shift + f ရိုက်ချိန် ပေါ်လာသော သ​င်္ကေတ [  ္] ကို ဝိရာမဟု ခေါ်သတတ်။ )</p>
<table>
<thead>
<tr>
<th>စာသား</th>
<th>မြန်မာအက္ခရာများ</th>
<th>keys</th>
</tr>
</thead>
<tbody>
<tr>
<td>စက္ကူ</td>
<td>စ + က + ္ + ူ</td>
<td>p + u + F + u + k</td>
</tr>
<tr>
<td>ဥက္ကဋ္ဌ</td>
<td>ဥ + က + ္ + က + ဋ + ္ + ဌ</td>
<td>U + u + F + u + # + F + X</td>
</tr>
<tr>
<td>ဘန္တေ</td>
<td>ဘ + ⁠ေ + န + ္ + တ</td>
<td>b + a + e + F + w</td>
</tr>
<tr>
<td>ကဏ္ဍ</td>
<td>က + ဏ + ္ + ဍ</td>
<td>u + P + F + !</td>
</tr>
<tr>
<td>ဝုဍ္ဎ</td>
<td>ဝ + ု + ဍ + ္ + ဎ</td>
<td>W + k + ! + F + B</td>
</tr>
<tr>
<td>ပဉ္စမ</td>
<td>ပ + ဉ + ္ + စ + မ</td>
<td>y + N + F + p + r</td>
</tr>
</tbody>
</table>
<h2 id="-">ကင်းစီး</h2>
<p>ကင်းစီးကို အောက်ခံဗျည်း ရိုက်ပြီးမှ ( ရံခါ ဗျည်း + ဗျည်းတွဲ ) f key ကို နှစ်ကြိမ်ရိုက်၍ ရိုက်နိုင်ပါသည်။ </p>
<p><strong>( အသတ်ခလုပ်နေရာကို နှစ်ကြိမ်ရိုက်ပါ။ ဖုန်းတို့တွင် ပါ⁠သော double tap သဘောမျိုး ဖြစ်ပါသည်။ )</strong></p>
<table>
<thead>
<tr>
<th>စာသား</th>
<th>မြန်မာအက္ခရာများ</th>
<th>keys</th>
</tr>
</thead>
<tbody>
<tr>
<td>မ​င်္ဂလာ</td>
<td>မ + ဂ + ် + ် + လ + ာ</td>
<td>r + * + f + f + v + m</td>
</tr>
<tr>
<td>အ​င်္ကျီ</td>
<td>အ + က +  ျ + ် + ် + ီ</td>
<td>t + u + s + f + f + D</td>
</tr>
<tr>
<td>သ​င်္ဘော</td>
<td>သ + ⁠ေ + ဘ + ် + ် + ာ</td>
<td>o + a + b + f + f + m</td>
</tr>
<tr>
<td>သ​င်္ကြန်</td>
<td>သ + က + ြ + ် + ် + န + ်</td>
<td>o + u + j + f + f + e + f</td>
</tr>
<tr>
<td>ခြ​င်္သေ့</td>
<td>ခ + ြ + ⁠ေ + သ + ် + ်</td>
<td>c + j + a + o + f + f</td>
</tr>
</tbody>
</table>
<p><strong>( ကင်းစီးကို ယူနီကုဒ်သိမ်းဆည်းမှုအစဉ်အားဖြင့် ရိုက်လိုကလည်း ရိုက်နိုင်ပါသည်။)</strong></p>
<h3 id="-">ယူနီကုဒ်သိမ်းဆည်းမှုအစဥ်အားဖြင့် ရိုက်ပုံ</h3>
<table>
<thead>
<tr>
<th>စာသား</th>
<th>မြန်မာအက္ခရာများ</th>
<th>keys</th>
</tr>
</thead>
<tbody>
<tr>
<td>မ​င်္ဂလာ</td>
<td>မ + င + ် +  ္ +  လ + ာ</td>
<td>r + i + f + F + * + v + m</td>
</tr>
<tr>
<td>အ​င်္ကျီ</td>
<td>အ + င + ် +  ္  + က +  ျ +  ီ</td>
<td>t + i + f + F + u + s + D</td>
</tr>
<tr>
<td>သ​င်္ဘော</td>
<td>သ + င + ် +  ္ + ⁠ေ + ဘ + ာ</td>
<td>o + i + f + F + a + b + m</td>
</tr>
</tbody>
</table>
<h2 id="-">သတိပြုရန် အက္ခရာများ</h2>
<ul>
<li>ရကောက် (ရ) နှင့် ခုနှစ် (၇)</li>
<li>ဂငယ် (ဂ) နှင့် ရှစ် (၈)</li>
<li>ဝလုံး (ဝ) နှင့် သုည (၀)</li>
<li>ဥ သရ နှင့် ဉ ကလေး</li>
<li>ဈ ဈမျဉ်းဆွဲ နှင့် စျ စလုံး + ယင့်</li>
<li>ဩ သရနှင့် ဩ သ+ရရစ် </li>
<li>ဦ သရနှင့် ဦ ဥ + လုံးကြီးတင်ဆံခတ်</li>
</ul>
<p>မတူသည်ကို သတိပြုပါ။</p>
<p>( စလုံး+ယပင့်အသုံး ပါဠိ၌ ထင်၏။  မွန်၊ကရင်စသည်တို့၌ သ+ရရစ် အသုံးရှိသတဲ့။ )</p>
<table>
<thead>
<tr>
<th>စာသား</th>
<th>အက္ခရာများ</th>
<th>keys</th>
<th>မှတ်ချက်</th>
</tr>
</thead>
<tbody>
<tr>
<td>စဉ်းစား</td>
<td>စ + ဉ + ် + စ + ာ + း</td>
<td>p + N + f + ; + p + m + ;</td>
<td>ဉ အစား ဥ ဖြင့် မရိုက်ရပါ။</td>
</tr>
<tr>
<td>ပဉှာ</td>
<td>ပ + ဉ + ှ + ာ</td>
<td>y + N + S + m</td>
<td>။ ။</td>
</tr>
<tr>
<td>ဝိုးတဝါး</td>
<td>ဝ + ိ + ု + း + တ + ဝ+ ါ + း</td>
<td>W + d + k + ; w + W + g + ;</td>
<td>သုညဖြင့်မရိုက်ရပါ။</td>
</tr>
<tr>
<td>ဈေး</td>
<td>⁠ေ + ဈ</td>
<td>a + Q</td>
<td>စလုံးယပင့်ဖြင့် မရိုက်ရ</td>
</tr>
</tbody>
</table>
<h2 id="-">သက္ကတအက္ခရာများ</h2>
<ul>
<li>ၐ ၊ ၑ ဟူသော ဗျည်းနှစ်လုံး </li>
<li>ၒ ၊ ၓ ၊ ၔ ၊ ၕ ဟူသော သရလေးလုံး</li>
<li>ၖ ၊  ၗ ၊  ၘ ၊  ၙ ဟူသော အထက်ပါသ⁠ရလေးလုံးတို့၏ ⁠ဗျည်းနှင့်တွဲစပ်ခိုက် ပုံသဏ္ဍာန် </li>
</ul>
<h3 id="keys-mapping">keys mapping</h3>
<table>
<thead>
<tr>
<th>key</th>
<th>အက္ခရာ</th>
</tr>
</thead>
<tbody>
<tr>
<td>K</td>
<td>ၐ</td>
</tr>
<tr>
<td>L</td>
<td>ၑ</td>
</tr>
<tr>
<td>:</td>
<td>ၖ</td>
</tr>
<tr>
<td>&lt;</td>
<td>ၗ</td>
</tr>
<tr>
<td>&gt;</td>
<td>ၘ</td>
</tr>
<tr>
<td>?</td>
<td>ၙ</td>
</tr>
</tbody>
</table>
<p>key အားလုံး shift ဖြင့် တွဲရိုက်ရပါသည်။ ဗျည်းနှင့်မစပ်သော သရလေးလုံးထက် ထိုသရတို့၏ ဗျည်းနှင့်စပ်သော ပုံသဏ္ဍာန်ကို အတွေ့များသည်ဟု ထင်မိသောကြောင့် ထိုဗျည်းနှင့်တွဲစပ်ခိုက် ပုံသဏ္ဍာန်ကို ဦးစားပေးထား၍ သီးသန့် key ထည့်ထားပေးသည်။ ဗျည်းနှင့်မစပ်သာ သရလေးကို ရိုက်လိုပါက ဗျည်းစပ်သရပုံသဏ္ဍာန်ကို နှစ်ကြိမ်ရိုက်ပါ။ (double tap သဘောမျိုးဖြစ်ပါသည်။ key သီးသန့်မမှတ်လို မထည့်လိုသောကြောင့် double tap စနစ်မျိုးကို အသုံးပြုထားပါသည်။)</p>
<table>
<thead>
<tr>
<th>စာသား</th>
<th>အက္ခရာများ</th>
<th>keys</th>
</tr>
</thead>
<tbody>
<tr>
<td>ၒ</td>
<td>ၖ +  ၖ</td>
<td>: + :</td>
</tr>
<tr>
<td>ၔ</td>
<td>ၗ + ၗ</td>
<td>&lt; + &lt;</td>
</tr>
<tr>
<td>ၔ</td>
<td>ၘ +  ၘ</td>
<td>&gt; + &gt;</td>
</tr>
<tr>
<td>ၕ</td>
<td>ၙ +  ၙ</td>
<td>? + ?</td>
</tr>
</tbody>
</table>
<h3 id="-">ရေဖ - ရ်္</h3>
<p>ရ + ် +  ္ သုံးပြီး ရိုက်ရမည်ဟု ဆိုထား၏။ key သုံး၍ ရိုက်လိုက right alt ( alt_gr ) နှင့် ` key ကို တွဲပြီး ရိုက်နိုင်ပါသည်။ (ဩ ကို ရိုက်သော key နေရာ)</p>
<h2 id="puntuations">puntuations</h2>
<p>အ​​င်္ဂလိပ်စာ၌ ပါသော puntuations တို့ကို သက်ဆိုင်ရာနေတို့၌ right alt (alt_gr) key ဖြင့် တွဲ၍ ရိုက်နိုင်ပါသည်။ ( right alt အစား ctrl + alt တွဲသုံးနိုင်ပါသည်။ အ​င်္ဂလိပ်ဂဏာန်းတို့ကိုလည်း shift + right alt တွဲသုံးပြီး ရိုက်နိုင်ပါသည်။</p>
<br>
<p>© 2020 SIL International</p>

